ingestion-environment/scripts/jmeter-load-testing.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Broker Parameters">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BrokerHost" elementType="Argument">
            <stringProp name="Argument.name">BrokerHost</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="BrokerPort" elementType="Argument">
            <stringProp name="Argument.name">BrokerPort</stringProp>
            <stringProp name="Argument.value">1883</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="Topic" elementType="Argument">
            <stringProp name="Argument.name">Topic</stringProp>
            <stringProp name="Argument.value">ingestion/telemetry</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="QoS" elementType="Argument">
            <stringProp name="Argument.name">QoS</stringProp>
            <stringProp name="Argument.value">1</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TlsEnabled" elementType="Argument">
            <stringProp name="Argument.name">TlsEnabled</stringProp>
            <stringProp name="Argument.value">0</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Scenario Parameters">
        <collectionProp name="Arguments.arguments">
          <elementProp name="NumberHomes" elementType="Argument">
            <stringProp name="Argument.name">NumberHomes</stringProp>
            <stringProp name="Argument.value">10</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="NumberMessages" elementType="Argument">
            <stringProp name="Argument.name">NumberMessages</stringProp>
            <stringProp name="Argument.value">100</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PayloadSize" elementType="Argument">
            <stringProp name="Argument.name">PayloadSize</stringProp>
            <stringProp name="Argument.value">14336</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DelayPerMessageMs" elementType="Argument">
            <stringProp name="Argument.name">DelayPerMessageMs</stringProp>
            <stringProp name="Argument.value">1000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Infrastructure Parameters">
        <collectionProp name="Arguments.arguments">
          <elementProp name="RampUpTimeSec" elementType="Argument">
            <stringProp name="Argument.name">RampUpTimeSec</stringProp>
            <stringProp name="Argument.value">10</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group (Publishers)">
        <stringProp name="ThreadGroup.num_threads">${NumberHomes}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RampUpTimeSec}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="Synchronizing Time (Group Threads)">
          <stringProp name="groupSize">${NumberHomes}</stringProp>
          <longProp name="timeoutInMs">10000</longProp>
        </SyncTimer>
        <hashTree/>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="Once Only Controller"/>
        <hashTree>
          <net.xmeter.samplers.ConnectSampler guiclass="net.xmeter.gui.ConnectSamplerUI" testclass="net.xmeter.samplers.ConnectSampler" testname="MQTT Connect - Publisher">
            <stringProp name="mqtt.server">${BrokerHost}</stringProp>
            <stringProp name="mqtt.port">${BrokerPort}</stringProp>
            <stringProp name="mqtt.version">3.1.1</stringProp>
            <stringProp name="mqtt.conn_timeout">10</stringProp>
            <stringProp name="mqtt.protocol">TCP</stringProp>
            <boolProp name="mqtt.dual_ssl_authentication">false</boolProp>
            <stringProp name="mqtt.client_id_prefix">conn_pub_</stringProp>
            <boolProp name="mqtt.client_id_suffix">true</boolProp>
            <stringProp name="mqtt.conn_keep_alive">600</stringProp>
            <stringProp name="mqtt.conn_attampt_max">0</stringProp>
            <stringProp name="mqtt.reconn_attampt_max">0</stringProp>
            <stringProp name="mqtt.conn_clean_session">true</stringProp>
          </net.xmeter.samplers.ConnectSampler>
          <hashTree/>
        </hashTree>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${NumberMessages}</stringProp>
        </LoopController>
        <hashTree>
          <net.xmeter.samplers.PubSampler guiclass="net.xmeter.gui.PubSamplerUI" testclass="net.xmeter.samplers.PubSampler" testname="MQTT Pub Sampler (Random Payload w/ Fixed Size)" enabled="false">
            <stringProp name="mqtt.topic_name">${Topic}</stringProp>
            <stringProp name="mqtt.qos_level">${QoS}</stringProp>
            <boolProp name="mqtt.add_timestamp">true</boolProp>
            <stringProp name="mqtt.message_type">Random string with fixed length</stringProp>
            <stringProp name="mqtt.message_type_fixed_length">${PayloadSize}</stringProp>
            <stringProp name="mqtt.message_to_sent">{&quot;teste&quot;: 123}</stringProp>
            <boolProp name="mqtt.retained_message">false</boolProp>
          </net.xmeter.samplers.PubSampler>
          <hashTree/>
          <net.xmeter.samplers.PubSampler guiclass="net.xmeter.gui.PubSamplerUI" testclass="net.xmeter.samplers.PubSampler" testname="MQTT Pub Sampler (Defined Payload)">
            <stringProp name="mqtt.topic_name">${Topic}</stringProp>
            <stringProp name="mqtt.qos_level">${QoS}</stringProp>
            <boolProp name="mqtt.add_timestamp">false</boolProp>
            <stringProp name="mqtt.message_type">String</stringProp>
            <stringProp name="mqtt.message_type_fixed_length">${PayloadSize}</stringProp>
            <stringProp name="mqtt.message_to_sent">{&quot;deviceId&quot;:&quot;EV-${__RandomString(6,abcdef0123456789)}&quot;,&quot;deviceType&quot;:&quot;ElectricVehicle&quot;,&quot;eventType&quot;:&quot;Telemetry&quot;,&quot;schemaVersion&quot;:&quot;1.0&quot;,&quot;timestamp&quot;:&quot;${__time(yyyy-MM-dd&apos;T&apos;HH:mm:ss&apos;Z&apos;)}&quot;,&quot;payload&quot;:{&quot;stateOfCharge&quot;:${__Random(10,100)},&quot;estimatedChargingTime&quot;:${__Random(600,14400)},&quot;voltage&quot;:${__Random(210,230)},&quot;current&quot;:${__Random(5,32)},&quot;activePower&quot;:${__Random(1000,7000)}},&quot;metadata&quot;:{&quot;regionId&quot;:&quot;SP-Campinas-${__Random(1,5)}&quot;,&quot;deviceLocation&quot;:&quot;Garage&quot;,&quot;deviceCategory&quot;:&quot;EV&quot;,&quot;deviceModel&quot;:&quot;TeslaModel${__Random(1,3)}&quot;,&quot;endUserId&quot;:&quot;user-${__Random(1,9999)}&quot;,&quot;contractType&quot;:&quot;${__chooseRandom(TimeOfUse|Conventional)}&quot;,&quot;programs&quot;:[&quot;DemandResponse&quot;,&quot;RenewableIntegration&quot;]}}
</stringProp>
            <boolProp name="mqtt.retained_message">false</boolProp>
          </net.xmeter.samplers.PubSampler>
          <hashTree/>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer (Delay Per Message Ms)">
            <stringProp name="ConstantTimer.delay">${DelayPerMessageMs}</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <kg.apc.jmeter.perfmon.PerfMonCollector guiclass="kg.apc.jmeter.vizualizers.PerfMonGui" testclass="kg.apc.jmeter.perfmon.PerfMonCollector" testname="jp@gc - PerfMon Metrics Collector">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">1000</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
        <collectionProp name="metricConnections">
          <collectionProp name="917712290">
            <stringProp name="-1204607085">localhost</stringProp>
            <stringProp name="1600768">4444</stringProp>
            <stringProp name="66952">CPU</stringProp>
          </collectionProp>
          <collectionProp name="-1383002031">
            <stringProp name="-1204607085">localhost</stringProp>
            <stringProp name="1600768">4444</stringProp>
            <stringProp name="-1993889503">Memory</stringProp>
          </collectionProp>
        </collectionProp>
      </kg.apc.jmeter.perfmon.PerfMonCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>